mobius-software-ltd/zerynth-lib-wiznet-w5100/csrc/lib/libraries/variant.h
#ifndef _VARIANT_ARDUINO_DUE_X_
#define _VARIANT_ARDUINO_DUE_X_

#include "inttypes.h"
#include <stdio.h>
#include "system_Device.h"
#ifndef utils_h
#include "../cores/utils.h"

#endif
#ifndef _SAM3X8E_
#include "sam3x8e.h"
#endif
/*
#ifndef _SAM3N_PIO_COMPONENT_
#include "../Ethernet/utility/component_pio.h"
#endif
*/
/*
 * SPI Interfaces
 */
#define SPI_INTERFACES_COUNT 1
#define SPI_INTERFACE       SPI0
#define SPI_INTERFACE_ID    ID_SPI0
#define SPI_CHANNELS_NUM 		 4
#define PIN_SPI_SS0          (77u)
#define PIN_SPI_SS1          (87u)
#define PIN_SPI_SS2          (86u)
#define PIN_SPI_SS3          (78u)
#define PIN_SPI_MOSI         (75u)
#define PIN_SPI_MISO         (74u)
#define PIN_SPI_SCK          (76u)
#define BOARD_SPI_SS0        (10u)
#define BOARD_SPI_SS1        (4u)
#define BOARD_SPI_SS2        (52u)
#define BOARD_SPI_SS3        PIN_SPI_SS3
#define BOARD_SPI_DEFAULT_SS BOARD_SPI_SS3

#define BOARD_PIN_TO_SPI_PIN(x) \
	(x==BOARD_SPI_SS0 ? PIN_SPI_SS0 : \
	(x==BOARD_SPI_SS1 ? PIN_SPI_SS1 : \
	(x==BOARD_SPI_SS2 ? PIN_SPI_SS2 : PIN_SPI_SS3 )))
#define BOARD_PIN_TO_SPI_CHANNEL(x) \
	(x==BOARD_SPI_SS0 ? 0 : \
	(x==BOARD_SPI_SS1 ? 1 : \
	(x==BOARD_SPI_SS2 ? 2 : 3)))

#define NUM_DIGITAL_PINS     (66u)
#define INPUT 0x0
#define OUTPUT 0x1
#define INPUT_PULLUP 0x2
#define HIGH 0x1
#define LOW 0x0
#define digitalPinToPort(P) ( _g_APinDescription[P].pPort )
#define digitalPinToBitMask(P) ( _g_APinDescription[P].ulPin )
uint8_t g_pinStatus[];
#define PIN_STATUS_DIGITAL_INPUT_PULLUP  (0x01)
#define PIN_STATUS_DIGITAL_INPUT         (0x02)
#define PIN_STATUS_DIGITAL_OUTPUT        (0x03)
#define PIN_STATUS_ANALOG                (0x04)
#define PIN_STATUS_PWM                   (0x05)
#define PIN_STATUS_TIMER                 (0x06)
#define PIN_STATUS_SERIAL                (0x07)
#define PIN_STATUS_DW_LOW                (0x10)
#define PIN_STATUS_DW_HIGH               (0x11)
#define PIO_PULLUP  (1u << 0)

#define PINS_COUNT           (79u)
#define PINS_CAN0            (90u)
#define PINS_CAN1            (91u)
#define ADC_FREQ_MAX   20000000
#define ADC_STARTUP_FAST     12

const uint8_t SS   = BOARD_SPI_SS0;
const uint8_t SS1  = BOARD_SPI_SS1;
const uint8_t SS2  = BOARD_SPI_SS2;
const uint8_t SS3  = BOARD_SPI_SS3;
const uint8_t MOSI = PIN_SPI_MOSI;
const uint8_t MISO = PIN_SPI_MISO;
const uint8_t SCK  = PIN_SPI_SCK;

/*
 * DUE Board pin   |  PORT  | Label
 * ----------------+--------+-------
 *   0             |  PA8   | "RX0"
 *   1             |  PA9   | "TX0"
 *   2       TIOA0 |  PB25  |
 *   3       TIOA7 |  PC28  |
 *   4       NPCS1 |  PA29  |
 *           TIOB6 |  PC26  |
 *   5       TIOA6 |  PC25  |
 *   6       PWML7 |  PC24  |
 *   7       PWML6 |  PC23  |
 *   8       PWML5 |  PC22  |
 *   9       PWML4 |  PC21  |
 *  10       NPCS0 |  PA28  |
 *           TIOB7 |  PC29  |
 *  11       TIOA8 |  PD7   |
 *  12       TIOB8 |  PD8   |
 *  13       TIOB0 |  PB27  | LED AMBER "L"
 *  14       TXD3  |  PD4   | "TX3"
 *  15       RXD3  |  PD5   | "RX3"
 *  16       TXD1  |  PA13  | "TX2"
 *  17       RXD1  |  PA12  | "RX2"
 *  18       TXD0  |  PA11  | "TX1"
 *  19       RXD0  |  PA10  | "RX1"
 *  20             |  PB12  | "SDA"
 *  21             |  PB13  | "SCL"
 *  22             |  PB26  |
 *  23             |  PA14  |
 *  24             |  PA15  |
 *  25             |  PD0   |
 *  26             |  PD1   |
 *  27             |  PD2   |
 *  28             |  PD3   |
 *  29             |  PD6   |
 *  30             |  PD9   |
 *  31             |  PA7   |
 *  32             |  PD10  |
 *  33             |  PC1   |
 *  34             |  PC2   |
 *  35             |  PC3   |
 *  36             |  PC4   |
 *  37             |  PC5   |
 *  38             |  PC6   |
 *  39             |  PC7   |
 *  40             |  PC8   |
 *  41             |  PC9   |
 *  42             |  PA19  |
 *  43             |  PA20  |
 *  44             |  PC19  |
 *  45             |  PC18  |
 *  46             |  PC17  |
 *  47             |  PC16  |
 *  48             |  PC15  |
 *  49             |  PC14  |
 *  50             |  PC13  |
 *  51             |  PC12  |
 *  52       NPCS2 |  PB21  |
 *  53             |  PB14  |
 *  54             |  PA16  | "A0"
 *  55             |  PA24  | "A1"
 *  56             |  PA23  | "A2"
 *  57             |  PA22  | "A3"
 *  58       TIOB2 |  PA6   | "A4"
 *  69             |  PA4   | "A5"
 *  60       TIOB1 |  PA3   | "A6"
 *  61       TIOA1 |  PA2   | "A7"
 *  62             |  PB17  | "A8"
 *  63             |  PB18  | "A9"
 *  64             |  PB19  | "A10"
 *  65             |  PB20  | "A11"
 *  66             |  PB15  | "DAC0"
 *  67             |  PB16  | "DAC1"
 *  68             |  PA1   | "CANRX"
 *  69             |  PA0   | "CANTX"
 *  70             |  PA17  | "SDA1"
 *  71             |  PA18  | "SCL1"
 *  72             |  PC30  | LED AMBER "RX"
 *  73             |  PA21  | LED AMBER "TX"
 *  74       MISO  |  PA25  |
 *  75       MOSI  |  PA26  |
 *  76       SCLK  |  PA27  |
 *  77       NPCS0 |  PA28  |
 *  78       NPCS3 |  PB23  | unconnected!
 *
 * USB pin         |  PORT
 * ----------------+--------
 *  ID             |  PB11
 *  VBOF           |  PB10
 *
 */
 /* Definitions and types for pins */
 typedef enum _EAnalogChannel
 {
   NO_ADC=-1,
   ADC0=0,
   ADC1,
   ADC2,
   ADC3,
   ADC4,
   ADC5,
   ADC6,
   ADC7,
   ADC8,
   ADC9,
   ADC10,
   ADC11,
   ADC12,
   ADC13,
   ADC14,
   ADC15,
   DA0,
   DA1
 } EAnalogChannel;

 #define ADC_CHANNEL_NUMBER_NONE 0xffffffff

 // Definitions for PWM channels
 typedef enum _EPWMChannel
 {
   NOT_ON_PWM=-1,
   PWM_CH0=0,
   PWM_CH1,
   PWM_CH2,
   PWM_CH3,
   PWM_CH4,
   PWM_CH5,
   PWM_CH6,
   PWM_CH7
 } EPWMChannel;

 // Definitions for TC channels
 typedef enum _ETCChannel
 {
   NOT_ON_TIMER=-1,
   TC0_CHA0=0,
   TC0_CHB0,
   TC0_CHA1,
   TC0_CHB1,
   TC0_CHA2,
   TC0_CHB2,
   TC1_CHA3,
   TC1_CHB3,
   TC1_CHA4,
   TC1_CHB4,
   TC1_CHA5,
   TC1_CHB5,
   TC2_CHA6,
   TC2_CHB6,
   TC2_CHA7,
   TC2_CHB7,
   TC2_CHA8,
   TC2_CHB8
 } ETCChannel;

 typedef enum _EPioType
 {
   PIO_NOT_A_PIN, /* Not under control of a peripheral. */
   PIO_PERIPH_A, /* The pin is controlled by the associated signal of peripheral A. */
   PIO_PERIPH_B, /* The pin is controlled by the associated signal of peripheral B. */
   PIO_PERIPH_C, /* The pin is controlled by the associated signal of peripheral C. */
   PIO_PERIPH_D, /* The pin is controlled by the associated signal of peripheral D. */
   PIO_INPUT, /* The pin is an input. */
   PIO_OUTPUT_0, /* The pin is an output and has a default level of 0. */
   PIO_OUTPUT_1 /* The pin is an output and has a default level of 1. */
 } EPioType ;
/*
 * Pins descriptions
 */
 typedef struct _PinDescription
 {
   Pio* pPort ;
   uint32_t ulPin ;
   uint32_t ulPeripheralId ;
   EPioType ulPinType ;
   uint32_t ulPinConfiguration ;
   uint32_t ulPinAttribute ;
   EAnalogChannel ulAnalogChannel ; /* Analog pin in the Arduino context (label on the board) */
   EAnalogChannel ulADCChannelNumber ; /* ADC Channel number in the SAM device */
   EPWMChannel ulPWMChannel ;
   ETCChannel ulTCChannel ;
 } PinDescription ;

 #define PIO_DEFAULT (0u << 0)
 #define PIN_ATTR_COMBO         (1UL<<0)
 #define PIN_ATTR_ANALOG        (1UL<<1)
 #define PIN_ATTR_DIGITAL       (1UL<<2)
 #define PIN_ATTR_PWM           (1UL<<3)
 #define PIN_ATTR_TIMER         (1UL<<4)

